-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Sep 22, 2024 at 10:02 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `dbhw8`
--

-- --------------------------------------------------------

--
-- Table structure for table `members`
--

CREATE TABLE `members` (
  `id` int(11) NOT NULL,
  `name` varchar(100) NOT NULL,
  `age` int(11) NOT NULL,
  `birthdate` date NOT NULL,
  `organization` varchar(255) NOT NULL,
  `address` varchar(255) NOT NULL,
  `village` varchar(100) DEFAULT NULL,
  `soi` varchar(100) DEFAULT NULL,
  `street` varchar(100) DEFAULT NULL,
  `subdistrict` varchar(100) DEFAULT NULL,
  `district` varchar(100) DEFAULT NULL,
  `province` varchar(100) DEFAULT NULL,
  `postalcode` varchar(10) DEFAULT NULL,
  `occupation` varchar(100) DEFAULT NULL,
  `workplace` varchar(255) DEFAULT NULL,
  `homephone` varchar(15) DEFAULT NULL,
  `mobilephone` varchar(15) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `members`
--

INSERT INTO `members` (`id`, `name`, `age`, `birthdate`, `organization`, `address`, `village`, `soi`, `street`, `subdistrict`, `district`, `province`, `postalcode`, `occupation`, `workplace`, `homephone`, `mobilephone`) VALUES
(1, 'ณัฏฐณิชา สีลาเขตต์', 20, '2004-01-16', 'โค้ช', '49', '1', 'คลองหกตะวันออก4', '', 'คลองหก', 'คลองหลวง', 'ปทุมธานี', '121200', 'นักศึกษา', 'มหาวิทยาลัย', '', '0952501864'),
(2, 'สมชาย นาคิน', 35, '1988-04-21', 'สมาคมกีฬาอุบลราชธานี', '123', '6', NULL, 'สายกลาง', 'นาแก', 'เมือง', 'อุบลราชธานี', '34000', 'ข้าราชการ', 'สำนักงานเขตอุบลฯ', '0451234567', '0819876543'),
(3, 'สมศรี วัฒนาวงศ์', 29, '1995-11-05', 'สมาคมครูจังหวัด', '56', '2', '2', 'เจริญกรุง', 'ขามใหญ่', 'วาริน', 'อุบลราชธานี', '34190', 'ครู', 'โรงเรียนขามใหญ่', NULL, '0822345678'),
(4, 'สุวิทย์ มณีรัตน์', 40, '1984-02-10', 'หน่วยงานพัฒนาชุมขน', '78', '5', '', 'สุขเกษม', 'เชียงคาน', 'เมือง', 'เลย', '42000', 'นักพัฒนา', 'พัฒนาชุมชนเชียงคาน', '0425678901', '0807654321'),
(5, 'อภิชัย สวนทอง', 33, '1990-07-18', 'โรงพยาบาลจังหวัดเชียงราย', '34', '3', NULL, 'พระราม 6	', 'เวียง', 'เมือง', 'เชียงราย', '57100', 'แพทย์', 'โรงพยาบาลเชียงราย', '0532345678', '0862345678'),
(6, 'อมรรัตน์ จันทร์ส่อง', 45, '1979-08-11', 'กองบัญชาการตำรวจภาค 3', '245', '4', '5', 'นิมิตรใหม่', 'บางบัวทอง', 'บางบัวทอง', 'นนทบุรี', '11110', 'ตำรวจ', 'สถานีตำรวจ บางบัวทอง', NULL, '0893456789'),
(7, 'วีรชัย รุ่งเรือง', 28, '1996-03-25', 'มูลนิธิเด็ก', '78', '7', NULL, 'ท่าเรือ', 'ท่าพระ', 'เมือง', 'ขอนแก่น', '40000', 'เจ้าหน้าที่', 'มูลนิธิเด็กขอนแก่น', '0431234567', '0811234567'),
(8, 'จินดา เพชรรัตน์', 37, '1986-01-10', 'สำนักงานสาธารณสุขเขต', '98', '2', '9', 'นวมินทร์', 'ลาดพร้าว', 'บางกะปิ', 'กรุงเทพฯ', '10240', 'พยาบาล', 'รพ.เวชศาสตร์ ลาดพร้าว', '029876543', '0852341234'),
(9, 'ศักดิ์ชัย สายชล', 55, '1968-09-15', 'สำนักงานเขตเมืองเก่า', '112', '9', NULL, 'เจริญผล', 'โนนสวรรค์', 'เมือง', 'สกลนคร', '47000', 'นักประวัติศาสตร์', 'สำนักงานเขตเมืองเก่า', NULL, '0899876543'),
(10, 'ประยูร ศรีศักดิ์', 42, '1982-12-12', 'สมาคมเกษตรกร', '46', '1', '12', 'พระอินทร', 'นาเพียง', 'เมือง', 'นครราชสีมา', '30000', 'เกษตรกร', 'สหกรณ์การเกษตร', '0442345678', '0816543210'),
(11, 'สุกัญญา บุญมา', 30, '1993-04-08', 'บริษัทอาหารเสริม', '65', '8', '7', 'รามคำแหง', 'ห้วยขวาง', 'ห้วยขวาง', 'กรุงเทพฯ', '10310', 'พนักงานบริษัท', 'บริษัทโภชนาการไทย', NULL, '0847654321'),
(12, 'ณัฐวุฒิ บัวรัตน์', 27, '1997-05-09', 'สำนักงานป้องกันน้ำท่วม', '9', '7', '4', 'พัฒนาการ', 'ราษฎร์บูรณะ', 'ราษฎร์บูรณะ', 'กรุงเทพฯ', '10140', 'วิศวกร', 'กรมทรัพยากรน้ำ', '023456789', '0883454321'),
(13, 'สุชาติ ใจดี', 50, '1974-06-21', 'สมาคมกีฬาสมุทรปราการ', '156', '5', NULL, 'ชัยพฤกษ์', 'เทพารักษ์', 'เมือง', 'สมุทรปราการ', '10270', 'นักกีฬา', 'สมาคมกีฬา สมุทรปราการ', NULL, '0892345678'),
(14, 'วรรณา ตันติวงศ์', 38, '1985-11-02', 'โรงเรียนมัธยมศึกษา', '30', '3', NULL, 'สุขุมวิท', 'บ่อไร่', 'เมือง', 'ตราด', '23000', 'ครู', 'โรงเรียนตราดวิทยาคม', NULL, '0829871234'),
(15, 'สมบัติ พวงทอง', 43, '1981-10-14', 'มูลนิธิช่วยเหลือผู้ป่วย', '93', '1', NULL, 'สุขสันต์', 'เกษตรวิสัย', 'เมือง', 'ร้อยเอ็ด', '45000', 'พนักงานอาสา', 'มูลนิธิร้อยเอ็ด', '0436543210', '0895432109'),
(16, 'วนิดา ดวงดี', 36, '1987-12-20', 'กองทัพบก', '56', '6', NULL, 'พิษณุโลก', 'บางแสน', 'เมือง', 'ชลบุรี', '20000', 'ทหาร', 'กองทัพบกชลบุรี', NULL, '0886543210'),
(17, 'พิชัย สายทอง', 31, '1992-03-14', 'กองบัญชาการตำรวจแห่งชาติ', '115', '9', '4', 'ประชาราษฎร์', 'ปทุมธานี', 'ปทุมธานี', 'ปทุมธานี', '12000', 'ตำรวจ', 'สถานีตำรวจปทุมธานี', '025432345', '0862345678'),
(18, 'รุ่งนภา จิตดี', 22, '2001-05-01', 'บริษัทขนส่ง', '45', '4', '7', 'พหลโยธิน', 'ลาดพร้าว', 'บางกะปิ', 'กรุงเทพฯ', '10240', 'พนักงานขนส่ง', 'บริษัทขนส่งไทย', '022345678', '083987654'),
(19, 'นพดล ใจรัก', 25, '1998-01-15', 'สมาคมกีฬาเมืองมุกดาหาร', '123/1', '1', '1', 'ประชาอุทิศ', 'มุกดาหาร', 'มุกดาหาร', 'มุกดาหาร', '49000', 'วิศวกร', 'บริษัท GHI จำกัด', '045123456', '0901234567'),
(20, 'วนิดา สะอาด', 22, '2001-04-25', 'สมาคมกีฬาระดับชาติ', '777/16', '1', '1', 'พหลโยธิน', 'เขาดินพัฒนา', 'เฉลิมพระเกียรติ', 'สระบุรี', '18000', 'นักวิจัย', 'มหาวิทยาลัย', '045666777', '0956789012');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `members`
--
ALTER TABLE `members`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `members`
--
ALTER TABLE `members`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
